# Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
# При вызове функции должен создаваться объект-генератор.
# Функция должна вызываться следующим образом: for el in fibo_gen().
# Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые 15 чисел.
# Подсказка: факториал числа n — произведение чисел от 1 до n.
# Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.

import math


def fib_gen():
    for el in range(15):
        yield el


func = fib_gen()
# print(g)

for el in func:
    final_num = math.factorial(el)
    print(f"Factorial of {el} is: {final_num}")
